; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-3nodes-1000size-5degree-100mindistance-4trucks-2packages-176seed

(define (problem transport-three-cities-sequential-3nodes-1000size-5degree-100mindistance-4trucks-2packages-176seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  truck-4 - vehicle
  package-1 - package
  package-2 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 228,796 -> 30,56
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 77)
  ; 30,56 -> 228,796
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 77)
  ; 228,796 -> 785,966
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 59)
  ; 785,966 -> 228,796
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 59)
  ; 2651,324 -> 2113,850
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 76)
  ; 2113,850 -> 2651,324
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 76)
  ; 2651,324 -> 2916,394
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 28)
  ; 2916,394 -> 2651,324
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 28)
  ; 1584,2494 -> 1642,2666
  (road city-3-loc-2 city-3-loc-1)
  (= (road-length city-3-loc-2 city-3-loc-1) 19)
  ; 1642,2666 -> 1584,2494
  (road city-3-loc-1 city-3-loc-2)
  (= (road-length city-3-loc-1 city-3-loc-2) 19)
  ; 1101,2006 -> 1642,2666
  (road city-3-loc-3 city-3-loc-1)
  (= (road-length city-3-loc-3 city-3-loc-1) 86)
  ; 1642,2666 -> 1101,2006
  (road city-3-loc-1 city-3-loc-3)
  (= (road-length city-3-loc-1 city-3-loc-3) 86)
  ; 1101,2006 -> 1584,2494
  (road city-3-loc-3 city-3-loc-2)
  (= (road-length city-3-loc-3 city-3-loc-2) 69)
  ; 1584,2494 -> 1101,2006
  (road city-3-loc-2 city-3-loc-3)
  (= (road-length city-3-loc-2 city-3-loc-3) 69)
  ; 785,966 <-> 2113,850
  (road city-1-loc-2 city-2-loc-1)
  (= (road-length city-1-loc-2 city-2-loc-1) 134)
  (road city-2-loc-1 city-1-loc-2)
  (= (road-length city-2-loc-1 city-1-loc-2) 134)
  (road city-1-loc-2 city-3-loc-1)
  (= (road-length city-1-loc-2 city-3-loc-1) 134)
  (road city-3-loc-1 city-1-loc-2)
  (= (road-length city-3-loc-1 city-1-loc-2) 134)
  (road city-2-loc-2 city-3-loc-1)
  (= (road-length city-2-loc-2 city-3-loc-1) 134)
  (road city-3-loc-1 city-2-loc-2)
  (= (road-length city-3-loc-1 city-2-loc-2) 134)
  (at package-1 city-1-loc-2)
  (at package-2 city-3-loc-2)
  (at truck-1 city-2-loc-2)
  (capacity truck-1 capacity-3)
  (at truck-2 city-2-loc-2)
  (capacity truck-2 capacity-4)
  (at truck-3 city-3-loc-2)
  (capacity truck-3 capacity-3)
  (at truck-4 city-3-loc-1)
  (capacity truck-4 capacity-2)
 )
 (:goal (and
  (at package-1 city-2-loc-1)
  (at package-2 city-3-loc-3)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-4 city-3-loc-1 city-1-loc-2)
   deleted: (at truck-4 city-3-loc-1)
   added: (at truck-4 city-1-loc-2)
   goals met: 0 of 2
2. (pick-up truck-4 city-1-loc-2 package-1 capacity-1 capacity-2)
   deleted: (at package-1 city-1-loc-2) (capacity truck-4 capacity-2)
   added: (in package-1 truck-4) (capacity truck-4 capacity-1)
   goals met: 0 of 2
3. (pick-up truck-3 city-3-loc-2 package-2 capacity-2 capacity-3)
   deleted: (at package-2 city-3-loc-2) (capacity truck-3 capacity-3)
   added: (in package-2 truck-3) (capacity truck-3 capacity-2)
   goals met: 0 of 2
4. (drive truck-3 city-3-loc-2 city-3-loc-3)
   deleted: (at truck-3 city-3-loc-2)
   added: (at truck-3 city-3-loc-3)
   goals met: 0 of 2
5. (drive truck-4 city-1-loc-2 city-2-loc-1)
   deleted: (at truck-4 city-1-loc-2)
   added: (at truck-4 city-2-loc-1)
   goals met: 0 of 2
6. (drop truck-3 city-3-loc-3 package-2 capacity-2 capacity-3)
   deleted: (in package-2 truck-3) (capacity truck-3 capacity-2)
   added: (at package-2 city-3-loc-3) (capacity truck-3 capacity-3)
   goals met: 1 of 2
7. (drop truck-4 city-2-loc-1 package-1 capacity-1 capacity-2)
   deleted: (in package-1 truck-4) (capacity truck-4 capacity-1)
   added: (at package-1 city-2-loc-1) (capacity truck-4 capacity-2)
   goals met: 2 of 2
